ThomasQi3141/doom-on-htn-badge/firmware/doom/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"

# UART0's pins drive the button shift register, so USB Serial/JTAG is the only
# console this board has.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_UART_DEFAULT=n

CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y

CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_FREERTOS_HZ=1000
CONFIG_BOOTLOADER_LOG_LEVEL_WARN=y
# Doom recurses through R_RenderBSPNode and the blockmap iterators. 8 KB was
# upstream-for-a-desktop thinking; a deeper BSP path is exactly the kind of
# thing that only blows up "once you get far enough into the level".
CONFIG_ESP_MAIN_TASK_STACK_SIZE=16384

# Every byte counts: the heap's largest contiguous block is only 188 KB.
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_SILENT=y

# On the ESP32-C3 instruction and data RAM come out of the same 400 KB, so
# every byte of IRAM handed back to flash is a byte Doom's zone can use.
CONFIG_FREERTOS_PLACE_FUNCTIONS_INTO_FLASH=y
CONFIG_FREERTOS_PLACE_SNAPSHOT_FUNS_INTO_FLASH=y
CONFIG_SPI_MASTER_ISR_IN_IRAM=n
CONFIG_SPI_MASTER_IN_IRAM=n
CONFIG_HAL_DEFAULT_ASSERTION_LEVEL=0
CONFIG_NEWLIB_NANO_FORMAT=y
CONFIG_ESP_ERR_TO_NAME_LOOKUP=n
CONFIG_ESP_DEBUG_STUBS_ENABLE=n
CONFIG_ESP_SYSTEM_USE_EH_FRAME=n
CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y

# --- WiFi, stripped down to ESP-NOW ---------------------------------------
# Co-op only ever broadcasts ESP-NOW frames: no AP, no lwIP, no netif, no
# station connect. Everything below either removes code the badge will never
# call or hands IRAM back to Doom's zone.
#
# IRAM and DRAM share one 400 KB pool on the C3, so pushing the WiFi hot paths
# into flash returns ~27 KB directly to the zone. It costs some throughput,
# which ESP-NOW at 78 bytes a tic will not notice.
CONFIG_ESP_WIFI_IRAM_OPT=n
CONFIG_ESP_WIFI_RX_IRAM_OPT=n

# No credentials are ever stored, so the NVS-backed config is dead weight.
CONFIG_ESP_WIFI_NVS_ENABLED=n
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=n

# Buffers: the default 10/32/32 is sized for TCP throughput. ESP-NOW sends one
# small frame per tic and we drain the queue every tic.
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=4
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=6
CONFIG_ESP_WIFI_DYNAMIC_TX_BUFFER_NUM=6

# Aggregation only helps bulk transfer, and it costs both buffers and latency.
CONFIG_ESP_WIFI_AMPDU_TX_ENABLED=n
CONFIG_ESP_WIFI_AMPDU_RX_ENABLED=n

# Unencrypted broadcast peer only.
CONFIG_ESP_WIFI_ESPNOW_MAX_ENCRYPT_NUM=0
CONFIG_ESP_WIFI_ENABLE_WPA3_SAE=n
CONFIG_ESP_WIFI_ENABLE_WPA3_OWE_STA=n
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=n
